In [3]:
import numpy as np
import pandas as pd
import seaborn as sns

In [7]:
from sklearn.model_selection import train_test_split, cross_val_score
from sklearn.metrics import accuracy_score
from sklearn.linear_model import LogisticRegression

In [37]:
df = pd.read_csv('train1.csv')[['Age', 'Pclass', 'SibSp', 'Parch', 'Survived']]

In [38]:
df.head()

    Age  Pclass  SibSp  Parch  Survived
0  22.0       3      1      0         0
1  38.0       1      1      0         1
2  26.0       3      0      0         1
3  35.0       1      1      0         1
4  35.0       3      0      0         0

In [39]:
df.dropna(inplace=True)

In [40]:
X = df.iloc[:,0:-1]
y = df.iloc[:,-1]

In [41]:
X.head()

    Age  Pclass  SibSp  Parch
0  22.0       3      1      0
1  38.0       1      1      0
2  26.0       3      0      0
3  35.0       1      1      0
4  35.0       3      0      0

In [42]:
np.mean(cross_val_score(LogisticRegression(), X,y, scoring='accuracy', cv=20))

0.6933333333333332

### Applying Feature Construction

In [43]:
X['Family'] = X['SibSp'] + X['Parch'] +1

In [44]:
X.head()

    Age  Pclass  SibSp  Parch  Family
0  22.0       3      1      0       2
1  38.0       1      1      0       2
2  26.0       3      0      0       1
3  35.0       1      1      0       2
4  35.0       3      0      0       1

In [47]:
# to divide the family

def myfunc(num):
    if num == 1:
        # alone travel
        return 0
        
    elif num>1 and num<=4:
        # small family
        return 1
        
    else :
        return 2

In [48]:
myfunc(4)

1

In [49]:
X['Family_type'] = X['Family'].apply(myfunc)

In [51]:
X.head(2)

    Age  Pclass  SibSp  Parch  Family  Family_type
0  22.0       3      1      0       2            1
1  38.0       1      1      0       2            1

In [54]:
X.drop(columns=['SibSp', 'Parch', 'Family'], inplace=True)

In [55]:
X.head()

    Age  Pclass  Family_type
0  22.0       3            1
1  38.0       1            1
2  26.0       3            0
3  35.0       1            1
4  35.0       3            0

In [56]:
np.mean(cross_val_score(LogisticRegression(), X,y, scoring='accuracy', cv=20))

0.7003174603174602

### Feature Spilitting

In [57]:
df = pd.read_csv('train1.csv')

In [58]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [59]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [74]:
# here we split on ',' and get next data
df['Title'] = df['Name'].str.split(',' , expand=True)[1]

In [75]:
df[['Title']].head()

                                         Title
0                              Mr. Owen Harris
1   Mrs. John Bradley (Florence Briggs Thayer)
2                                  Miss. Laina
3           Mrs. Jacques Heath (Lily May Peel)
4                            Mr. William Henry

In [76]:
# here also split the data on '.' and get that 1st data
df['Title'] = df['Title'].str.split('.' , expand=True)[0]

In [77]:
df[['Title', 'Name']]

     Title                                               Name
0       Mr                            Braund, Mr. Owen Harris
1      Mrs  Cumings, Mrs. John Bradley (Florence Briggs Th...
2     Miss                             Heikkinen, Miss. Laina
3      Mrs       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4       Mr                           Allen, Mr. William Henry
..     ...                                                ...
886    Rev                              Montvila, Rev. Juozas
887   Miss                       Graham, Miss. Margaret Edith
888   Miss           Johnston, Miss. Catherine Helen "Carrie"
889     Mr                              Behr, Mr. Karl Howell
890     Mr                                Dooley, Mr. Patrick

[891 rows x 2 columns]

In [80]:
df.groupby('Title')['Survived'].mean().sort_values(ascending=False)

Title
the Countess    1.000000
Mlle            1.000000
Sir             1.000000
Ms              1.000000
Lady            1.000000
Mme             1.000000
Mrs             0.792000
Miss            0.697802
Master          0.575000
Col             0.500000
Major           0.500000
Dr              0.428571
Mr              0.156673
Jonkheer        0.000000
Rev             0.000000
Don             0.000000
Capt            0.000000
Name: Survived, dtype: float64

In [ ]:
df['Is_Married'] = 0
df['IsMarried'].loc[df['Title'] == 'Mrs'] =